[Survived] BlockStatement
Github/steps/source/clipObject.js:1:44
-function clipObject(payload, lower, upper) {
-  if(payload >= lower && payload <= upper) {
-    return true;
-  } else {
-    return false;
-  }
-}
+function clipObject(payload, lower, upper) {}
 
 module.exports = clipObject;

[Survived] EqualityOperator
Github/steps/source/clipObject.js:2:26
 function clipObject(payload, lower, upper) {
-  if(payload >= lower && payload <= upper) {
+  if(payload >= lower && payload > upper) {
     return true;
   } else {

[Survived] ConditionalExpression
Github/steps/source/clipObject.js:2:6
 function clipObject(payload, lower, upper) {
-  if(payload >= lower && payload <= upper) {
+  if(true) {
     return true;
   } else {

[Survived] BooleanLiteral
Github/steps/source/clipObject.js:3:12
 function clipObject(payload, lower, upper) {
   if(payload >= lower && payload <= upper) {
-    return true;
+    return false;
   } else {
     return false;

[Survived] BlockStatement
Github/steps/source/clipObject.js:4:10
 function clipObject(payload, lower, upper) {
   if(payload >= lower && payload <= upper) {
     return true;
-  } else {
-    return false;
-  }
+  } else {}
 }
 
